app/controllers/movies_controller.rb

  def director_select
    movie = Movie.find(params[:id])
    director_name = movie.director

    if not director_name or director_name.empty?
      flash[:notice] = %Q{'#{movie.title}' has no director info}
      redirect_to movies_path
    else
      @movies = Movie.where(director:director_name)
      flash[:notice] = %Q{There are #{@movies.size} movie(s) with "#{director_name}" as director}
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 9]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "John Doe"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "John Doe"]]